glossary = {
    "Функція": "Блок коду, який виконує певну задачу і може бути повторно використаний.",
    "Словник": "Змінна типу даних, яка зберігає пари ключ-значення.",
    "Ітерація": "Процес проходження через елементи колекції (наприклад, списку або словника).",
    "Клас": "Шаблон або структура для створення об'єктів у програмуванні.",
    "Модуль": "Файл Python, який містить код (функції, класи), що може бути імпортований у інші програми."
}

for term, definition in glossary.items():
    print(f"{term}:\n\t{definition}\n")
